practice2.xml

<Envelope
  xmlns:soap-enc="http://schemas.xmlsoap.org/soap/encoding/"	
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:cwmp="urn:dslforum-org:cwmp-1-0"
  xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">

	<soap:Body>
		<cwmp:Inform>
			<DeviceId>
				<Manufacturer>SomeCompany</Manufacturer>
				<OUI>000A73</OUI>
				<ProductClass>IGD</ProductClass>
				<SerialNumber>123456789</SerialNumber>
			</DeviceId>
		</cwmp:Inform>
		<Event soap-enc:arrayType="cwmp:EventStruct[1]">
			<EventStruct>
				<EventCode>2 PERIODIC</EventCode>
				<CommandKey/>
			</EventStruct>
		</Event>
		<MaxEnvelopes>1</MaxEnvelopes>
		<CurrentTime>2008-10-23T01:49:14+00:00</CurrentTime>
		<RetryCount>0</RetryCount>
		<ParameterList soap-enc:arrayType="cwmp:ParameterValueStruct[6]">
			<ParameterValueStruct>
				<Name>Device.DeviceSummary</Name>
				<Value xsi:type="xsd:string" />
			</ParameterValueStruct>
			<ParameterValueStruct>
				<Name>Device.DeviceInfo.HardwareVersion</Name>
				<Value xsi:type="xsd:string">3.1</Value>
			</ParameterValueStruct>
			<ParameterValueStruct>
				<Name>Device.DeviceInfo.SoftwareVersion</Name>
				<Value xsi:type="xsd:string">1.1.5.13</Value>
			</ParameterValueStruct>
			<ParameterValueStruct>
				<Name>Device.ManagementServer.ConnectionRequestURL</Name>
				<Value xsi:type="xsd:string">http://10.0.0.5:1234/</Value>
			</ParameterValueStruct>
			<ParameterValueStruct>
				<Name>Device.ManagementServer.ParameterKey</Name>
				<Value xsi:type="xsd:string">null</Value>
			</ParameterValueStruct>
			<ParameterValueStruct>
				<Name>Device.LAN.IPAddress</Name>
				<Value xsi:type="xsd:string">192.168.1.1</Value>
			</ParameterValueStruct>
		</ParameterList>
		
	
	</soap:Body>
</Envelope>